doc/devel/server-scripts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-27 Tue 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PBench server script states and rsyncing from remotes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nick Dokos" />
<meta name="keywords" content="pbench" />
<link rel="stylesheet" href="../../stylesheets/normalize.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/github-light.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">PBench server script states and rsyncing from remotes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfffeab9">Introduction</a></li>
<li><a href="#org193f138">Directory structure</a></li>
<li><a href="#org72b5597">pbench-rsync-remote script: current state</a></li>
<li><a href="#orgcffdbea">pbench-rsync-remote script: future state</a>
<ul>
<li><a href="#org0bfc0ef">Slowness fix</a></li>
<li><a href="#orgf9b29e0">Processing part</a></li>
<li><a href="#orgf899afb">Delete script</a></li>
</ul>
</li>
<li><a href="#orgf8caef9">Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfffeab9" class="outline-2">
<h2 id="orgfffeab9">Introduction</h2>
<div class="outline-text-2" id="text-orgfffeab9">
<p>
The server scripts are invoked by cron at varying intervals. They
figure out what tarballs to process, then process them (what "process
them" means is specific to each server script), and then set things up
so that the next stage in the pipeline can do its job.
</p>

<p>
To figure out what tarballs to process in each invocation, the scripts
look into a <b>state</b> directory, specific to the script. Any symbolic
links to tarballs found there are added to the (script-internal) queue
for the current invocation of the script. The script will process all the
tarballs in its queue and then move the symbolic links to the state
directory for the next script.
</p>

<p>
Schematically each script does the following:
</p>

<div class="org-src-container">
<pre><code class="src src-shell">linksrc = state subdirectory for this script
linkdest = state sudbdirectory for next script

<span style="font-weight: bold; font-style: italic;">queue</span>=$(<span style="font-weight: bold;">find</span> list of tarballs<span style="font-weight: bold;"> in</span> $<span style="font-weight: bold; font-style: italic;">linksrc</span>)

<span style="font-weight: bold;">for</span> each element<span style="font-weight: bold;"> in</span> queue ;<span style="font-weight: bold;">do</span>
    process it
    <span style="font-weight: bold;">if</span> success
       move the symlink from $<span style="font-weight: bold; font-style: italic;">linksrc</span> to $<span style="font-weight: bold; font-style: italic;">linkdest</span>
    <span style="font-weight: bold;">else</span>
       move it to some error subdirectory
<span style="font-weight: bold;">done</span>
send mail with the list of successes and failures
</code></pre>
</div>

<p>
The <code>linksrc</code> and <code>linkdest</code> of each script are currently hard-coded, but
this is a bug: they are dependent on the configuration (production
does things differently than ec2 e.g.) so they should be specified in
the environment's server config file for each script and read from
there.
</p>
</div>
</div>


<div id="outline-container-org193f138" class="outline-2">
<h2 id="org193f138">Directory structure</h2>
<div class="outline-text-2" id="text-org193f138">
<p>
The state directories are kept on the server under each controller hostname
in the archive subdirectory of the pbench volume, e.g.
</p>

<p>
The structure looks like this:
</p>

<p>
&#x2026;/archive/fs-version-001/&lt;host&gt;/&#x2026;tarballs and MD5 sums&#x2026;
                                 /TODO
                                 /TO-COPY-SOS
                                 /TO-INDEX
                                 /INDEXED
                                 /TO-LINK
We will add some more subdirs (see below):
                                 /TO-SYNC (on remotes)
                                 /TO-PROCESS-REMOTE-TARBALLS
                                 /TO-DELETE-REMOTE-TARBALLS
</p>

<p>
In addition, there are some "retirement" subdirs, where tarballs
that have errors go to spend the rest of their days.
</p>
</div>
</div>

<div id="outline-container-org72b5597" class="outline-2">
<h2 id="org72b5597">pbench-rsync-remote script: current state</h2>
<div class="outline-text-2" id="text-org72b5597">
<p>
The <code>pbench-rsync-remote</code> script is a bit different. It takes the environment
name, the name of the remote server and the remote archive directory as arguments
and currently does something like this:
</p>

<pre class="example">

ARCHIVE=local-archive-directory
hosts=$(ssh $remoteserver 'cd $remotearchive; ls')

for host in $hosts ;do
    # make local host directory to receive the contents of the remote host directory
    mkdir -p $ARCHIVE/$prefix::$host
    cd $ARCHIVE/$prefix::$host
    # copy the remote contents over
    rsync $remoteserver:$remotearchive/$host/ .
    check MD5
    if success
       delete the tarball and its MD5 sum from the remote
    else
       report the failure
done

Add the tarballs that were good to the processing queue, sorted by size.
Submit them a few at a time for unpacking on the local system.
Send mail with the stats.
</pre>
<p>
The trouble is that the rsync is run for every host, whether that host
has any tarballs for copying or not. Unfortunately, that takes about 5
seconds, even if the host directory is empty. For a couple of hundred
hosts, we end up spending 20 minutes in this loop, even if there is
nothing to be done.
</p>
</div>
</div>

<div id="outline-container-orgcffdbea" class="outline-2">
<h2 id="orgcffdbea">pbench-rsync-remote script: future state</h2>
<div class="outline-text-2" id="text-orgcffdbea">
<p>
There are three things that we want to do:
</p>

<ul class="org-ul">
<li>fix the slowness identified above.</li>
<li>break up the script into an rsync part and a processing part.</li>
<li>add a script to delete tarballs (both archived and unpacked) on
the remote.</li>
</ul>
</div>

<div id="outline-container-org0bfc0ef" class="outline-3">
<h3 id="org0bfc0ef">Slowness fix</h3>
<div class="outline-text-3" id="text-org0bfc0ef">
<p>
We will fix this by having the remotes explicitly add symlinks to the
relevant tarballs into the host's TO-SYNC subdirectory.  This will be
done by changing the <code>linkdest</code> value of the <code>pbench-unpack-tarballs</code>
script to be TO-SYNC (<code>pbench-unpack-tarballs</code> and <code>pbench-edit-prefixes</code>
are the only scripts that are run in the EC2 environment - the latter uses
the TO-LINK subdir as its <code>linksrc</code>, but it has no <code>linkdest</code>: it just deletes
the links from the TO-LINK subdir after it's done).
</p>

<p>
The initial gathering of remote data will involve a single ssh invocation
which will use <code>find</code> to find all the tarballs to be processed by looking
in each TO-SYNC subdir. We can use <code>find</code> in symlink-resolving mode to get
the full pathnames of the tarballs themselves. The list will have to be
modified to add the MD5 sum files for each tarball, but that can be done
within the <code>pbench-rsync-remote</code> script purely algorithmically.
</p>

<p>
In principle, the list could be passed directly to <code>rsync</code> but it might
be long and we might run into command lenght problems, so it's better
to use xargs (although IIRC, interpolating arguments into a command is
a bit tricky).
</p>

<p>
After checking the MD5 sums, any tarballs that passed can be safely
deleted from the remote, MD5 sum file and TO-SYNC symlink included.
</p>

<p>
After the breakup, the above can be the first script, except that it
will have to pass the list of tarballs to the second part to be processed.
We will create a subdir, TO-PROCESS-REMOTE-TARBALLS, and the rsync part
will symlink the list of tarballs into each host's TO-PROCESS-REMOTE-TARBALLS
subdir.
</p>
</div>
</div>

<div id="outline-container-orgf9b29e0" class="outline-3">
<h3 id="orgf9b29e0">Processing part</h3>
<div class="outline-text-3" id="text-orgf9b29e0">
<p>
The processing part will generate a list of tarballs to process, again by
doing a <code>find</code> on the TO-PROCESS-REMOTE-TARBALLS subdirs. It will sort
the tarballs by size and it will trickle them into the TODO subdirs
of each host, where <code>pbench-unpack-tarballs</code> can find them and process
them through the full production pipeline.
</p>

<p>
Once a tarball is processed, the corresponding unpacked directory
on the remote can be deleted. This will be done in the third script
below - all that the processing script will do is (you guessed it)
plant a symlink into yet another subdir, TO-DELETE-REMOTE-TARBALLS.
</p>
</div>
</div>

<div id="outline-container-orgf899afb" class="outline-3">
<h3 id="orgf899afb">Delete script</h3>
<div class="outline-text-3" id="text-orgf899afb">
<p>
The delete script will do the usual <code>find</code> through the
TO-DELETE-REMOTE-TARBALLS subdirs for each host and arrange for
each of them to be deleted from the remote.
</p>

<p>
The point is that the links will stick around until explicitly moved
so if there are problems reaching the remote, the deletion will be delayed
but it will eventually happen. Of course, if we cannot reach the remote,
mail to that effect will be sent out.
</p>
</div>
</div>
</div>


<div id="outline-container-orgf8caef9" class="outline-2">
<h2 id="orgf8caef9">Notes</h2>
<div class="outline-text-2" id="text-orgf8caef9">
<p>
Note that we'll need a separate rsync script for each remote environment,
and they might very well be running at different frequencies. The processing
script can be a single script. The delete script might be a single script
or multiple scripts, one per remote environment. That's TBD.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Page updated: 2017-06-27 Tue 10:30</p>
</div>
</body>
</html>
